---
type: SolidCurveIntersection
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# SolidCurveIntersection

`Autodesk.Revit.DB.SolidCurveIntersection` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBasicIEnumerator | — | `internal virtual IEnumerator GetBasicIEnumerator ()` |
| Method | GetCurveSegment | 2013 | `public Curve GetCurveSegment ( int index )` |
| Method | GetCurveSegmentExtents | 2013 | `public CurveExtents GetCurveSegmentExtents ( int index )` |
| Method | GetEnumerator | — | `public virtual IEnumerator < Curve > GetEnumerator ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ResultType | 2013 | `public SolidCurveIntersectionMode ResultType { get ; }` |
| Property | SegmentCount | 2013 | `public int SegmentCount { get ; }` |